<script language="JavaScript">var PUpage="76001067"; var PUprop="geocities"; </script><script language="JavaScript" src="../../../www.geocities.com/js_source/pu5geo.js"></script><script language="JavaScript" src="../../../www.geocities.com/js_source/ygNSLib943a0.js?v3"></script><script language="JavaScript">var yvnContents='http://us.toto.geo.yahoo.com/toto?s=76001067&amp;l=NE&amp;b=0&amp;t=1029420997';yvnR='us';yfnEA(0);</script>
<!-- text above generated by server. PLEASE REMOVE -->
<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>

<!-- Mirrored from www.psantos.org/ribafs/access/algumasdefinicoes.htm by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 30 Apr 2018 10:57:12 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=UTF-8" /><!-- /Added by HTTrack -->
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Ribamar FS">
   <meta name="GENERATOR" content="Mozilla/4.7 [en] (Win98; I) [Netscape]">
   <title>Cantinho dos Amantes do Access - Intrudu&ccedil;&atilde;o - Alguns Conceitos</title>
</head>
<body>
&nbsp;
<table BORDER COLS=8 WIDTH="100%" >
<tr>
<td>
<center><font size=-1><a href="http://www.geocities.com/cantinhodemais/introducao.htm">Introdu&ccedil;&atilde;o</a></font></center>
</td>

<td>
<center><font size=-1><a href="http://www.geocities.com/cantinhodemais/tabelas.htm">Tabelas</a></font></center>
</td>

<td>
<center><font size=-1><a href="http://www.geocities.com/cantinhodemais/relacionamentos.htm">Relacionamentos</a></font></center>
</td>

<td>
<center>&nbsp;<font size=-1><a href="http://www.geocities.com/cantinhodemais/consultas.htm">Consultas</a></font></center>
</td>

<td>
<center><font size=-1><a href="http://www.geocities.com/cantinhodemais/formularios.htm">Formul&aacute;rios</a></font></center>
</td>

<td>
<center>&nbsp;<font size=-1><a href="http://www.geocities.com/cantinhodemais/relatorios.htm">Relat&oacute;rios</a></font></center>
</td>

<td>
<center>&nbsp;<font size=-1><a href="http://www.geocities.com/cantinhodemais/macros.htm">Macros</a></font></center>
</td>

<td>
<center><font size=-1><a href="http://www.geocities.com/cantinhodemais/modulos.htm">M&oacute;dulos</a></font></center>
</td>
</tr>

<tr>
<td>
<center><font size=-1><a href="http://www.geocities.com/cantinhodemais/activex.htm">ActiveX</a></font></center>
</td>

<td>
<center>&nbsp;<font size=-1><a href="http://www.geocities.com/cantinhodemais/automacao.htm">Automa&ccedil;&atilde;oOLE</a></font></center>
</td>

<td>
<center>&nbsp;<font size=-1><a href="http://www.geocities.com/cantinhodemais/graficos.htm">Gr&aacute;ficos</a></font></center>
</td>

<td>
<center>&nbsp;<font size=-1><a href="http://www.geocities.com/cantinhodemais/dao.htm">DAO</a></font></center>
</td>

<td>
<center>&nbsp;<font size=-1><a href="http://www.geocities.com/cantinhodemais/sql.htm">SQL</a></font></center>
</td>

<td>
<center>&nbsp;<font size=-1><a href="http://www.geocities.com/cantinhodemais/seguranca.htm">Seguran&ccedil;a</a></font></center>
</td>

<td>
<center><font size=-1><a href="http://www.geocities.com/cantinhodemais/redes.htm">Redes/ODBC</a></font></center>
</td>

<td>
<center>&nbsp;<font size=-1><a href="http://www.geocities.com/cantinhodemais/dicas.htm">Dicas</a></font></center>
</td>
</tr>

<tr>
<td>
<center>&nbsp;<font size=-1><a href="http://www.geocities.com/cantinhodemais/cursoonline.htm">Curso
Online</a></font></center>
</td>

<td>
<center><font size=-1><a href="http://www.geocities.com/cantinhodemais/wizards.htm">Wizards</a></font></center>
</td>

<td>
<center><font size=-1><a href="http://www.geocities.com/cantinhodemais/ferramentas.htm">Ferramentas</a></font></center>
</td>

<td>
<center><font size=-1><a href="http://www.geocities.com/cantinhodemais/help.htm">Help</a></font></center>
</td>

<td>
<center>&nbsp;<font size=-1><a href="http://www.geocities.com/cantinhodemais/downloads.htm">Downloads</a></font></center>
</td>

<td>
<center>&nbsp;<font size=-1><a href="http://www.geocities.com/cantinhodemais/links.htm">Links</a></font></center>
</td>

<td>
<center><font size=-1><a href="http://www.geocities.com/cantinhodemais/novidades.htm">Novidades</a></font></center>
</td>

<td>
<center><font size=-1><a href="http://www.geocities.com/cantinhodemais/entrada.htm">FAQs</a></font></center>
</td>
</tr>

<tr>
<td></td>

<td></td>

<td></td>

<td>
<center><a href="http://www.geocities.com/cantinhodemais/">Index</a></center>
</td>

<td></td>

<td></td>

<td></td>

<td></td>
</tr>
</table>

<center>
<p><b><font size=+1>ALGUNS CONCEITOS IMPORTANES EM ACCESS</font></b></center>

<hr WIDTH="100%">
<center><b><font color="#FF0000">TIPOS DE TABELAS</font></b></center>

<p>Defini&ccedil;&atilde;o &eacute; algo que muda muito de autor para autor.
Aqui vamos falar das defini&ccedil;&otilde;es utilizadas no Ajuda do Access,
mas alguns livros usam termos diferentes. O mais importante &eacute; entender
o que cada defini&ccedil;&atilde;o significa para n&atilde;o incorrer em
erro.
<p>- Prim&aacute;ria
<br>- Estrangeira
<br>- Externa
<p><b>Tabela Prim&aacute;ria</b> - Aquela que todos os seus Campos dizem
respeito apenas a ela pr&oacute;pria, como &eacute; o caso de Clientes,
Funcion&aacute;rios, Alunos, etc. Este tipo de Tabela tamb&eacute;m est&aacute;
sempre no lado um de um Relacionamento um para v&aacute;rios.
<p><b>Tabela Estrangeira</b> - A Tabela do lado v&aacute;rios do Relacionamento
um para v&aacute;rios e onde nem todos os Campos dizem respeito a ela pr&oacute;pria,
pois encontramos Campos que s&atilde;o Chaves de outras Tabelas. Exemplos:
Pedidos, Vendas, etc, onde na Tabela Vendas temos Campos como C&oacute;digo
do Cliente.
<p><b>Tabela Externa</b> - Uma Tabelas que est&aacute; noutro Banco de
Dados.
<center>
<p><b><font color="#FF0000">CHAVE</font></b></center>

<p>Uma Chave de uma Tabela &eacute; o Campo que consegue identificar de
forma exclusiva um Registro. AChave pode ser comporta por dois ou mais
Campos.
<center>
<p><b><font color="#FF0000">TIPOS DE CHAVES</font></b></center>

<p>- Chaves Prim&aacute;rias
<br>- Estrangeiras
<br>- Externas
<center>
<p><b><font color="#FF0000">Tipos de Chaves Prim&aacute;rias</font></b></center>

<p>- Autonumera&ccedil;&atilde;o
<br>- De um Campo
<br>- De v&aacute;rios Campos
<p><b>Chave Prim&aacute;ria AutoNumera&ccedil;&atilde;o</b> - O tipo mais
simples e pr&aacute;tico, que define automaticamente um n&uacute;mero em
sequ&ecirc;ncia para o Campo Chave.
<p><b>Chave Prim&aacute;ria de um Campo</b> - &Eacute; aquele onde o Autonumera&ccedil;&atilde;o
n&atilde;o atende e precisamos de um Campo chave personalizado como o CPF,
a RG, n&uacute;meros de Matr&iacute;cula de alunos, professores, funcion&aacute;rios,
etc.
<p><b>Chave Prim&aacute;ria de v&aacute;rios Campos</b> - Ocorre geralmente
em Tabelas do lado v&aacute;rios de um Relacionamento para v&aacute;rios,
no caso de Vendas, Pedidos, Itens, etc.
<center>
<p><b>Chave Estrangeira</b></center>

<p>&Eacute; a cheve que que encontra-se em uma Tabela estrangeira e que
&eacute; Chave prim&aacute;ria na Tabela do lado um de um Relacionamento
um para v&aacute;rios.
<center>
<p><b>Chave Externa</b></center>

<p>&Eacute; a que encontra-se numa Tabela Externa.
<center>
<p><b><font color="#FF0000">&Iacute;NDICE</font></b></center>

<p>Os dados em um Banco de Dados s&atilde;o armazenados na ordem em que
s&atilde;o introduzidos, que &eacute; a ordem f&iacute;sica ou real. Um
&iacute;ndice consegue exibir os registros numa outra ordem e guarda ponteiros
para os registros reais. Os &iacute;ndices aceleram as pesquisas e classifica&ccedil;&otilde;es
no Banco de Dados, como o &iacute;ndice de um livro tamb&eacute;m ajuda
a encontrar mais r&aacute;pido um assunto.
<p>Criamos um &iacute;ndice quando mudamos (setamos) a Indexado de um Campo
para Sim.
<p><b>DICA</b>: Os Campos do tipo Memorando, Hyperlink e Objeto OLE n&atilde;o
podem ser indexados.
<center>
<p><b><font color="#FF0000">RELACIONAMENTOS</font></b></center>

<p>O conceito de Tabela diz que cada Tabela deve conter informa&ccedil;&otilde;es
apenas sobre um &uacute;nico assunto, ou seja, todos os Campos na Tabela
Clientes devem dizer respeito apenas a Clientes.
<p>Acontece que em uma Venda &eacute; muito importante registrar o Cliente
para quem foi, o Vendedor que efetuou, os Produtos, etc.
<p>Ent&atilde;o colocamos uma "c&oacute;pia" da Chave da Tabela Prim&aacute;ria
na Tabela Estrangeira. Quando isso acontece a Chave acrescentada na Tabela
Estrangeira transforma-se em Chave Estrangeira e podemos relacionar as
duas Tabelas pelas Chaves.
<p>O C&oacute;digo do Cliente em Clientes tem duplica&ccedil;&atilde;o
n&atilde;o autorizada, pois queremos que ele seja suficiente para identificar
com exclusividade cada Cliente, mas em Vendas ele deve ter duplica&ccedil;&atilde;o
autorizada, j&aacute; que precisamos permitir que um Cliente esteja em
mais de uma Venda.
<p>Este tipo de Relacionamento entre Clientes e Vendas &eacute; o <b>um
para v&aacute;rios,</b> aquele onde um Cliente estar&aacute; em v&aacute;rias
Vendas.
<br>&nbsp;
<br>&nbsp;
<br>
<br>
<center>
<p><b><font color="#FF0000">INTEGRIDADE REFERENCIAL</font></b></center>

<p>&Eacute; o conjunto de regras do Access destinado a garantir a integridade
das informa&ccedil;&otilde;es contra a exclus&atilde;o ou altera&ccedil;&otilde;es
acidentais.
<center>
<p><b>Regras da Integridade Referencial</b></center>

<p>- O Campo da Tabela Prim&aacute;ria &eacute; Chave Prim&aacute;ria ou
possui um &iacute;ndice exclusivo.
<br>- As Tabelas devem estar em um mesmo Banco de Dados
<br>- N&atilde;o se pode inserir um Registro no lado v&aacute;rios que
n&atilde;o exista no lado um. Exemplo: n&atilde;o posso efetuar uma Venda
para um Cliente que n&atilde;o esteja cadastrado.
<br>- N&atilde;o podemos alterar um Campo Chave prim&aacute;ria do lado
um se existirem registros relacionados no lado v&aacute;rios. Exemplo:
n&atilde;o podemos alterar o C&oacute;dogo de um Cliente que tenha Vendas
cadastradas em seu nome.
<p>Obs.: Como ao impor Integridade Referencial o Access proibir&aacute;
a exclus&atilde;o ou altera&ccedil;&atilde;o de alguns registros, n&oacute;s
podemos marcar as duas caixinhas abaixo da Integridade Referencial:
<p>- Propagar Atualiza&ccedil;&atilde;o dos Campos Relacionados e
<br>- Propagar Exclus&atilde;o dos Registros Relacionados
<p>Para que os Access possa fazer automaticamente sem comprometer a Integridade
Referencial.
<p><b>Propagar Atualiza&ccedil;&atilde;o dos Campos Relacionados</b> -
Atualizar automaticamente os Campos do lado v&aacute;rios quando a Chave
prim&aacute;ria for alterada do lado um.
<p><b>Propagar Exclus&atilde;o dos Registros Relacionados</b> - Excluir
automaticamente todos os registros da Tabela do lado v&aacute;rios quando
um registro relacionado for excluido no lado um.
<center>
<p><b>Relacionamento Passo-a-passo</b></center>

<p><b>Relacionamento um para v&aacute;rios de um &uacute;nico Campo</b>
<p>Vamos trabalhar com duas Tabelas: a Clientes e a Vendas, onde a Chave
prim&aacute;ria da Clientes &eacute; C&oacute;digo do Cliente e existe
uma Chave Estrangeira C&oacute;digo do Cliente na Tabela Vendas para que
o relacionamento seja feito.
<p>- O primeiro passo deve ter sido dado na constru&ccedil;&atilde;o das
Tabelas, quando devemos fazer uma c&oacute;pia da Chave prim&aacute;ria
para a Tabela Estrangeira.
<br>- Abra ent&atilde;o a janela de Relacionamentos clicando no bot&atilde;o
da barra de ferramentas
<br>- Abre-se ent&atilde;o uma janela com as Tabelas do BD. Seleciona as
Tabelas Clientes e Vendas e d&ecirc; um duplo clique em cada.
<br>- Agora clique em C&oacute;digo do Cliente na Tabela Clientes e arraste
e solte sobre C&oacute;digo do Clientes em Vendas.
<br>- Veja que os dois Campos aparecem na janela. Marque Impor Integridade
Referencial e as outras duas CheckBox abaixo e clique em Criar. Caso tudo
esteja OK aparece uma linha unindo os dois Campos com um 1 do lado de Clientes
e com um alfa do lado de Vendas.
<p><b>Relacionamento um para v&aacute;rios de v&aacute;rios Campos</b>
<p>Agora iremos trabalhar com as Tabelas Vendas e ItensVendas.
<br>A Vendas tem o Campo Chave prim&aacute;ria composta por C&oacute;digo
da Venda, C&oacute;digo do Cliente e C&oacute;digo do Funcion&aacute;rio
(nesta ordem) e a ItensVendas formada por C&oacute;digo da Venda, C&oacute;digo
do Cliente, C&oacute;digo do Funcion&aacute;rio e C&oacute;digo do Produto
(tamb&eacute;m respeitando esta ordem).
<br>Veja que a Chave de ItensVendas tem todos os Campos de Vendas e ainda
mais um de Protudos (para relacionar com Produtos). Aqui a regra geral
&eacute; que o lado um tenha um Campo a menos na Chave que o lado v&aacute;rios.
<br>A ordem dos Campos tamb&eacute;m &eacute; muito importante e deve ser
preservada na Tabela Estrangeira.
<p>- Abra a janela de Relacionamentos
<br>- Adiciona as Tabelas Vendas e ItensVendas
<br>- Clique no C&oacute;digo da Venda na Tabela Vendas, prenda a tecla
Shift e clique em C&oacute;digo do Funcion&aacute;rio para selecionar os
3. Arraste e solte sobre C&oacute;digo de Vendas em ItensVendas.
<br>- Veja que do lado direito est&aacute; vazio e teremos que indicar
os Campos correspondestes na Tabela ItensVendas, de maneira que fique assim:
<br>&nbsp;
<table BORDER COLS=2 WIDTH="100%" >
<tr>
<td>
<center>Vendas</center>
</td>

<td>
<center>ItensVendas</center>
</td>
</tr>

<tr>
<td>C&oacute;digo da Venda&nbsp;</td>

<td>C&oacute;digo da Venda</td>
</tr>

<tr>
<td>C&oacute;digo do Cliente</td>

<td>C&oacute;digo do Cliente</td>
</tr>

<tr>
<td>C&oacute;digo do Funcion&aacute;rio</td>

<td>C&oacute;digo do Funcion&aacute;rio</td>
</tr>
</table>

<p>- Marque Impor Integridade Referencial e as duas CheckBox Propagar e
clique em Criar.
<br>- Prontinho.
<p><b>Poss&iacute;veis problemas na constru&ccedil;&atilde;o de Relacionamento</b>:
<p>- Quando o tipo de dados n&atilde;o &eacute; id&ecirc;ntico.
<br>- Quando cadastramos dados que violam as regras (ent&atilde;o exclua
os dados e volte a fazer o relacionamento)
<br>- Quando a Tabela j&aacute; est&aacute; relacionada e aparece por exemplo
Clientes1 (isso indica que est&aacute; Tabela j&aacute; est&aacute; na
janela de Relacionamentos, exclua esta e procure a outra).
<p>Sempre leia atentamente a mensagem de erro para saber o que est&aacute;
havendo.
<br>---------------------------------------
<br>&nbsp;Cantinho dos Amantes do Access
<br>&nbsp; www.ribafs.hpg.com.br/access
</body>

<!-- Mirrored from www.psantos.org/ribafs/access/algumasdefinicoes.htm by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 30 Apr 2018 10:57:12 GMT -->
</html>
<!-- text below generated by server. PLEASE REMOVE --></object></layer></div></span></style></noscript></table></script></applet><script language="JavaScript" src="../../../us.i1.yimg.com/us.yimg.com/i/mc/mc.js"></script><script language="JavaScript" src="../../../us.geocities.com/js_source/geov2.html"></script><script language="javascript">geovisit();</script><noscript><img src="http://visit.geocities.com/visit.gif?1029420997" border=0 width=1 height=1></noscript>
<IMG SRC="http://geo.yahoo.com/serv?s=76001067&amp;t=1029420997" ALT=1 WIDTH=1 HEIGHT=1>
