<html> 
<!-- Mirrored from www.psantos.org/ribafs/access/links.htm by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 30 Apr 2018 10:57:12 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=UTF-8" /><!-- /Added by HTTrack -->
<head>          <meta http-equiv="Content-Type"  content="text/html; charset=iso-8859-1">            <meta name="Author" content="Ribamar FS">            <meta name="GENERATOR"  content="Mozilla/4.76 [en] (Win98; U) [Netscape]">   <title>Cantinho dos Amantes do Access - Links</title>     </head>     <body>   &nbsp;   <table border="1" cols="8" width="100%">   <tbody>      <tr>   <td>               <center><font size="-1"><a  href="http://www.geocities.com/cantinhodemais/introducao.htm">Introdu&ccedil;&atilde;o</a></font></center>   </td>    <td>               <center><font size="-1"><a  href="http://www.geocities.com/cantinhodemais/tabelas.htm">Tabelas</a></font></center>   </td>    <td>               <center><font size="-1"><a  href="http://www.geocities.com/cantinhodemais/relacionamentos.htm">Relacionamentos</a></font></center>   </td>    <td>               <center>&nbsp;<font size="-1"><a  href="http://www.geocities.com/cantinhodemais/consultas.htm">Consultas</a></font></center>   </td>    <td>               <center><font size="-1"><a  href="http://www.geocities.com/cantinhodemais/formularios.htm">Formul&aacute;rios</a></font></center>   </td>    <td>               <center>&nbsp;<font size="-1"><a  href="http://www.geocities.com/cantinhodemais/relatorios.htm">Relat&oacute;rios</a></font></center>   </td>    <td>               <center>&nbsp;<font size="-1"><a  href="http://www.geocities.com/cantinhodemais/macros.htm">Macros</a></font></center>   </td>    <td>               <center><font size="-1"><a  href="http://www.geocities.com/cantinhodemais/modulos.htm">M&oacute;dulos</a></font></center>   </td>   </tr>    <tr>   <td>               <center><font size="-1"><a  href="http://www.geocities.com/cantinhodemais/activex.htm">ActiveX</a></font></center>   </td>    <td>               <center>&nbsp;<font size="-1"><a  href="http://www.geocities.com/cantinhodemais/automacao.htm">Automa&ccedil;&atilde;oOLE</a></font></center>   </td>    <td>               <center>&nbsp;<font size="-1"><a  href="http://www.geocities.com/cantinhodemais/graficos.htm">Gr&aacute;ficos</a></font></center>   </td>    <td>               <center>&nbsp;<font size="-1"><a  href="http://www.geocities.com/cantinhodemais/dao.htm">DAO</a></font></center>   </td>    <td>               <center>&nbsp;<font size="-1"><a  href="http://www.geocities.com/cantinhodemais/sql.htm">SQL</a></font></center>   </td>    <td>               <center>&nbsp;<font size="-1"><a  href="http://www.geocities.com/cantinhodemais/seguranca.htm">Seguran&ccedil;a</a></font></center>   </td>    <td>               <center><font size="-1"><a  href="http://www.geocities.com/cantinhodemais/redes.htm">Redes/ODBC</a></font></center>   </td>    <td>               <center>&nbsp;<font size="-1"><a  href="http://www.geocities.com/cantinhodemais/dicas.htm">Dicas</a></font></center>   </td>   </tr>    <tr>   <td>               <center>&nbsp;<font size="-1"><a  href="http://www.geocities.com/cantinhodemais/cursoonline.htm">Curso Online</a></font></center>   </td>    <td>               <center><font size="-1"><a  href="http://www.geocities.com/cantinhodemais/wizards.htm">Wizards</a></font></center>   </td>    <td>               <center><font size="-1"><a  href="http://www.geocities.com/cantinhodemais/ferramentas.htm">Ferramentas</a></font></center>   </td>    <td>               <center><font size="-1"><a  href="http://www.geocities.com/cantinhodemais/help.htm">Help</a></font></center>   </td>    <td>               <center>&nbsp;<font size="-1"><a  href="http://www.geocities.com/cantinhodemais/downloads.htm">Downloads</a></font></center>   </td>    <td>               <center>&nbsp;<font size="-1"><a  href="http://www.geocities.com/cantinhodemais/links.htm">Links</a></font></center>   </td>    <td>               <center><font size="-1"><a  href="http://www.geocities.com/cantinhodemais/novidades.htm">Novidades</a></font></center>   </td>    <td>               <center><font size="-1"><a  href="http://www.geocities.com/cantinhodemais/entrada.htm">FAQs</a></font></center>   </td>   </tr>    <tr>   <td><br>        </td>    <td><br>        </td>    <td><br>        </td>    <td>               <center><a href="http://www.geocities.com/cantinhodemais/">Index</a></center>   </td>    <td><br>        </td>    <td><br>        </td>    <td><br>        </td>    <td><br>        </td>   </tr>         </tbody>  </table>      <center>   <p><b><font size="+3">LINKS</font></b></p></font>  </center>      <hr width="100%"> <br>  <b><font size="+2">EM PORTUGU&Ecirc;S</font><br> <br> <p>- <a href="http://www.access.psantos.org/maccess.php">Site de Access do Paulo Santos</a> - Site com manuais de access, excel e introdução à informática. Confira. </p>  <a href="http://www.ativoaccess.com.br/"><u>- </u>Ativo Access</a> - </font></b><font size="+2">Site com muita coisa boa. Atualmente com um presente exclusivo: o CEP completo e mastigadinho em v&aacute;rios bancos de dados divididos por estado.<br>  <p>- <a href="http://access2000.webhostme.com/">Access 2000</a> - Novo site  Access despontando.&nbsp; O autor promete muito trabalho. Confira. </p>   <p>- <a href="http://www.angelfire.com/ok/leonelmuniz">Leonel</a> - Muitos  bons exemplos de bancos de dados. Os arquivos s&atilde;o compactados com a senha "LEOLEO", sem as aspas e em mai&uacute;sculas. </p>   <p>- <a href="http://www.manualaccess.cjb.net/">ManualAccess</a> - Site com  diversos tutoriais sobre Access. </p>   <p>- <a href="http://www.geocities.com/archipoaccess/">Access - A linguagem  do Futuro</a> - Exemplos, apostilas, dicas. Um modelo de Folha de Pagamento,  Relat&oacute;rio zebrado, Cr&iacute;tica do CNPJ, entre outros. Site pessoal  do colega Archipo Wilson. </p>   <p>- <a href="http://www.geocities.com/pmpg98_pt/">Microsoft Access Free Samples and Examples</a> - Site em portugu&ecirc;s, apesar do t&iacute;tulo. Com dicas e exemplos &uacute;teis do Pedro Gil. </p>   <p>- <a href="http://www.santuarioaccess.hpg.com.br/">Santu&aacute;rio Access</a>  - Site muito bom: lotado de exemplos, dicas e muito mais. </p>   <p>- <a href="http://www.mundoaccess.hpg.com.br/">Mundo Access</a> - Sites  com diversos Samples e dicas. </p>   <p>- Demo de Sistema em Access no site do Victor - <a  href="http://www.vicmafre.hpg.com.br/">VicMaFre Softwares</a> </p>   <p>- <a href="http://www.forumaccess.com.br/">Forum Access</a>&nbsp; Um grupo  de profissionais que trabalham com o Acesss (tamb&eacute;m VB e Office). Eles tem uma publica&ccedil;&atilde;o que &eacute; distribuida mediante assinatura,  realmente muito boa para quem trabalha com Access. Na p&aacute;gina deles  existe uma &aacute;rea de download, onde se pode baixar os arquivos que acompanham  as publica&ccedil;&otilde;es (mesmo n&atilde;o sendo assinante), utilit&aacute;rios  e outros. Tem tamb&eacute;m, entre outras coisas, um excelente <a  href="http://209.213.101.230/eshare/server?action=190&amp;PAGE=0&amp;EXPANDFULLY=0&amp;EXPANDBRANCH=0&amp;ASORT=3&amp;BSORT=1&amp;AEXPAND=&amp;BEXPAND=&amp;BOARD=4">Forum  sobre Access</a>.(onde voc&ecirc; encontra ajuda para suas d&uacute;vidas  e tamb&eacute;m pode ajudar outras pessoas). </p>   <p>- <a href="http://www2.uol.com.br/info/forum/access.html">Forum da Info  Exame</a> Outro Forum muito bom, apenas n&atilde;o gosto de quando clico num link e volto, ele volta para a primeira mensagem. Mas um bom local para se aprender muito sobre Access. </p>   <p>- <a href="http://orbita.starmedia.com/~samblues/access.htm">Amantes  da Programa&ccedil;&atilde;o</a> Este &eacute; um grupo, como o nome dar a entender, de programadores em geral. Existem tamb&eacute;m programadores de Access. &Eacute; um grupo todo original, id&eacute;ia do SamBlues. Voc&ecirc;  preenche um cadastro, colocando as linguagens em que mexe e tamb&eacute;m  uma avalia&ccedil;&atilde;o (de 1 a 5): 1 - est&aacute; querendo aprender  ainda e 5 - expert (claro que existem os intermedi&aacute;rios). Ent&atilde;o  o Sam cria/mant&eacute;m um banco de dados com todos e manda para o grupo  o banco de dados com os nomes e e-mails de todos. Ent&atilde;o voc&ecirc;  manda sua d&uacute;vida para quem desejar (mande as dicas tamb&eacute;m :)).  </p>   <p>- <a href="http://estoque.virtualave.net/home2.shtml">Estoque</a>&nbsp;  Muitas dicas e utilit&aacute;rios para Access. Muito bom. Clique no link Access.  </p>   <p>- <a href="http://www.aprendaemcasa.com.br/">Projeto Aprenda em Casa</a>  - Onde s&atilde;o oferecidos cursos gratuitos com envio de apostilas via e-mail: cursos diversos como Access 2000 e SQL Server, VBA, Delphi, etc. </p>   <p>- <a href="http://www.ideologica.com.br/dicas/Index2.htm">Dicas do CSI</a>&nbsp;  P&aacute;gina muito boa, v&aacute;rias dicas. </p>   <p>- <a href="http://membro.intermega.com.br/accesshome/">Access Home</a>  Apesar do nome &eacute; uma p&aacute;gina brasileira, sobre Access e VB. Com dicas, apostilas e cursos.. </p>   <p>- <a  href="http://www.terravista.ciclone.com.br/PraiaBrava/1295/index.html">Access  Brasil</a> Outra boa p&aacute;gina brasileira sobre Access. </p>   <p>- <a href="http://www.geocities.com/Athens/Oracle/3800/apost.htm">Apostilas</a>&nbsp;  Aqui voc&ecirc; encontra muitas apostilas, inclusive de Access. Vale a visita.  </p>   <p>- <a  href="http://www.geocities.com/SiliconValley/Cable/1005/apostila.htm">Apostilas  Download</a> Outro bom site de apostilas. </p>   <p>- <a href="http://orbita.starmedia.com/~accessbrasil/pgina.htm">Access  Brasil2</a> Outro Access Brasil, com muitas dicas e apostilas. </p>   <p>- <a href="http://www.vbbrasil.com/vb/controles_utilitarios.html">Visual  BASIC Brasil - Controles</a> Bem, um excelente site sobre VB e tamb&eacute;m  encontramos controles OCX (ActiveX) para o Access. </p>   <p>- <a href="http://www.tecnet.pt/dmn/dmn851.html">"MS ACCESS"</a>&nbsp;  Esta &eacute; de Portugal. </p>   <p>- <a href="http://www.geocities.com/SiliconValley/Bay/3994/">VB do Macoratti</a>  VB com Bancos de Dados. Muita coisa boa no site. Caso queira um espelho completo zipado n&atilde;o muito atualizado deste site, v&aacute; at&eacute; a se&ccedil;&atilde;o VB do site: <a  href="http://pagina.de/manual.linux/">http://pagina.de/manual.linux/</a>.  </p>   <p>- <a href="http://baco.ccuec.unicamp.br/apostilas/inicioapost.htm">UNICAMP</a>  - Onde podemos encontrar tamb&eacute;m uma apostila de Access 97 no formato  pdf. Voc&ecirc; deve cadastrar-se para ter acesso &agrave; &aacute;rea de  download, mas &eacute; gratuito. </p>   <p>- <a href="http://www.psantos.org/ribafs/access/hprecursos.htm">Tutorial de Elabora&ccedil;&atilde;o de Home  Page</a> - Sei que &eacute; meio off&nbsp; topic mas como pode ser &uacute;til  a quem quer criar uma p&aacute;gina e tamb&eacute;m a quem j&aacute; tem uma, v&aacute; l&aacute;.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <b><font  color="#ff0000"><font size="+1">Novo</font></font></b> </p>   <p>&nbsp;- <a href="http://www.cade.com.br/">Cad&ecirc;?</a> - Tinha que colocar  este link, mesmo n&atilde;o sendo espec&iacute;fico de Access, encontra-se  muita coisa sobre o mesmo. </p>   <p>- <a href="http://www.todobr.com.br/">TodoBR</a> - Novo instrumento de  busca brasileiro. Muito bom. </p>   <p><b>APOSTILAS DE ACCESS E AFINS EM SITES BRASILEIROS:</b> </p>   <p>- http://membro.intermega.com.br/aceccarelli/access3.zip&nbsp; (14kb -  2.0) <br>  - http://www.tba.com.br/pages/eberval/ApostilAccess7.zip&nbsp; (137kb - 95)  <br>  - http://207.226.24.170/apostilas/files/access.zip&nbsp; (614kb - 97) <br>  - http://207.226.24.170/apostilas/files/access2.zip (137 kb - 2.0) <br>  - http://207.226.24.170/apostilas/files/access1.zip (184 kb - 2.0 Avan&ccedil;ado)  <br>  - http://www.geocities.com/Eureka/Boardroom/1440/access97.zip (522kb - 97)  <br>  - http://inf.pa.unisul.rct-sc.br/~osmarjr/download/apostila/aptacces.zip (167kb - 2.0) <br>  - http://inf.pa.unisul.rct-sc.br/~osmarjr/download/apostila/aptavlsist.zip  (16kb - Avalia&ccedil;&atilde;oSistema) <br>  - http://inf.pa.unisul.rct-sc.br/~osmarjr/download/apostila/aptbdaavan.zip  (3kb - Avan&ccedil;. BD) <br>  - http://www.tol.pro.br/index.html (Site com muitas apostilas - 320) <br>  - http://www.tol.pro.br/Apostilas/SGBD/ (Diret&oacute;rio de BD, com 27 Apostilas de Access e outros) <br>  - http://www.informit.com/My/Accounts/ (Cadastrar-se para ler livros free)  <br>  - http://msdn.microsoft.com/isapi/msdnlib.idc/ (Livros da Microsoft) <br>  - http://search.support.microsoft.com/kb/c.asp?fr=0&amp;sa=gn&amp;lng=eng/  (Busca na MS) <br>  - http://www.geocities.com/SiliconValley/Ridge/3505/access2.zip (105kb -  2.0) <br>  - http://www.geocities.com/SiliconValley/Ridge/3505/acc97ap.zip (143 kb - 97) <br>  - http://members.xoom.com/_XMCM/riba/access/cursoonline.htm (Online - 97)  <br>  - http://www.todobr.com.br/ (Instrumento de busca brasileiro, muito bom) </p>   <p> </p>   <hr width="100%"> <br>  <b><font size="+2">EM INGL&Ecirc;S</font></b>   <p><b><font size="+1">De Onde Receber Informa&ccedil;&otilde;es Via E-mail:</font></b>  </p>   <p>- <a href="http://www.comeandread.com/access/">MaxMan's Access 97 Pages</a>  <br>  - <a href="http://web.tampabay.rr.com/databasing/">Access 97 Help</a> <br>  - <a href="http://www.codefarmer.com/">CodeFarmer</a> <br>  - <a href="http://www.egroups.com/subscribe/access-dev/">Ms Access Developers  Forum</a> <br>  - <a  href="http://www.tek-tips.com/gthreadminder.cfm/lev2/4/lev3/27/pid/181/r/47">MS  Access Techinical Help Forum</a> </p>   <p><b><font size="+1">Samples</font></b> </p>   <p><a href="http://www.accessarchive.com/">Access Archive</a> </p>   <p><b><font size="+1">Seguran&ccedil;a</font></b> </p>   <p>- <a href="http://www.crak.com/">Password Recovery</a> - Ferramentas para  quebra de Senha do Access, Word, Excel, etc. </p>   <p><b><font size="+1">Microsoft</font></b> </p>   <p>- <a href="http://www.microsoft.com/downloads/default.asp?">Se&ccedil;&atilde;o  de Download da Microsoft</a> - Esta se&ccedil;&atilde;o tem muitos Bancos  de Dados de exemplo, lotados de dicas e modelos de sistemas Access, como tamb&eacute;m tutoriais, Suplementos, Atualiza&ccedil;&otilde;es, etc. Ap&oacute;s acessar, selecione a vers&atilde;o do Access que usa e a vers&atilde;o do Sistema operacinal. </p>   <p>- <a href="http://www.microsoft.com/office/access/default.htm">Microsoft  Access</a> P&aacute;gina principal do Access na Microsoft. Onde podemos encontrar muita informa&ccedil;&atilde;o, Service Packs, Utilit&aacute;rios, atualiza&ccedil;&otilde;es em geral para esta maravilhosa ferramenta. </p>   <p>- <a href="http://support.microsoft.com/search/">Microsoft Knowledge Base  - Search</a>&nbsp; Aqui podemos encontrar muita informa&ccedil;&atilde;o importante sobre o Access. Lembrando que para procurar por um determinado Knowledge Base deve-se digitar o n&uacute;mero antecedido de Q, por exemplo Q125334.  <br>  As p&aacute;ginas da Microsoft s&atilde;o melhor visualizadas com o Internet  Explorer, de prefer&ecirc;ncia do 5 em diante. </p>   <p>- <a href="http://officeupdate.microsoft.com/">Microsoft Office Update</a>  - Muita coisa para atualizar o MS Office.&nbsp;&nbsp;&nbsp;&nbsp; <b><font  color="#ff0000"><font size="+1">Novo</font></font></b> </p>   <p><b><font size="+1">Diversos</font></b> </p>   <p>- <a href="http://www.toptown.com/nowhere/jinhui/">ActiveX em Geral</a>  Muitos controles OCX share e freeware interessantes (Gifs Animados, Texto  Gira, Alarm, etc). Lembre de registrar seu controle para evitar aquela mensagem.  </p>   <p>- <a href="http://www.accesshelp.net/survival/">The AccessHelp.net - Survival  Guide</a> O nome est&aacute; dizendo muito. </p>   <p>- <a href="http://www.zdjournals.com/zdtips/">Microsoft Access Tips</a>  - Este &eacute; da Ziff-Davis, onde voce pode cadastrar-se para receber dicas via e-mail. S&atilde;o bem b&aacute;sicas, mas &eacute; interessante. Tamb&eacute;m existem dicas para VB e outros. </p>   <p>- <a href="http://www.wrox.com/">Developer's Journal</a> - Jornal para  desenvolvedores gratuito (VB, Access e cia). &Eacute; da editora Wrox e o IE visualiza melhor. Para receber em casa o jornal, voce deve se cadastrar,  colocando seu e-mail &agrave; direita e acima e clicar no bot&atilde;o Subscribe  me. Nessa p&aacute;gina tamb&eacute;m podemos baixar cap&iacute;tulos juntamente  com c&oacute;digo fonte de licros.&nbsp;&nbsp;&nbsp;&nbsp; <b><font  color="#ff0000"><font size="+1">Novo</font></font></b> </p>   <p>- <a href="http://www.vbxtras.com/">The Ultimate Tools Catalog for VB</a>  - Deste tamb&eacute;m podemos receber pelos correios um cat&aacute;logo de ferramentas com muita coisa para VB. Cadastre-se colocando seu e-mail acima do bot&atilde;o subscribe &agrave; direita. Voc&ecirc; pode listar os produtos ou procurar algum outro. Veja s&oacute; a quantidade! Existe tamb&eacute;m uma &aacute;rea de download de demos dos produtos.  <b><font  color="#ff0000"><font size="+1">Novo</font></font></b> </p>   <p>- <a href="http://www.pinpub.com/access/tips.htm">Access Tip</a> Dicas  do Access. </p>   <p>- <a href="http://www.advisor.com/wHome.nsf/w/MMBmain">Advisor</a> Access,  VB e SQL.Com dicas (tips) por e-mail e forum. Veja s&oacute; sobre quantos  assuntos voc&ecirc; pode receber dicas:&nbsp; active server pages - asp, com--dcom--com+, component technology,&nbsp; customer relationship management,&nbsp; database development, e-business management, e-business technology, enterprise application integration, filemaker pro, internet security, it profession, java, knowledge management, lotus notes &amp; domino administration, lotus notes &amp; domino development, lotus notes &amp; domino, microsoft access development, microsoft exchange server, microsoft office &amp; vba development, microsoft outlook development, microsoft sql server, microsoft visual basic, microsoft visual foxpro, mobile computing, office technology, oracle, palm computing, supply chain technology, systems &amp; storage, visual basic language - vba, web development e xml. </p>   <p>- <a href="http://msadp.digitaldreamshop.com/">Access Developer's Page</a>  Access para programadores Access e VB. </p>   <p>- <a  href="http://dir.lycos.com/Computers/Software/Databases/MS_Access/">Access  no Lycos</a> Muitas p&aacute;ginas de Access. </p>   <p>- <a href="http://www.officevba.com/">Office VBA</a> VBA para o Office  em geral. </p>   <p>- <a href="http://www.jcomsoft.com/">J Component Software: ActiveX &amp;  OCX Shareware and Freeware</a> </p>   <p>- <a  href="http://www.deja.com/group/microsoft.public.access.tablesdbdesign">DejaNews</a>  Muitas dicas de Access no News DejaNews. <br>  &nbsp; </p>   <p><b><font size="+2">UTILIT&Aacute;RIOS</font></b> </p>   <p>- <a href="http://support.microsoft.com/support/downloads/PNP124.asp">Microsoft  Download</a> Muitos utilit&aacute;rios, bancos de dados de exemplo (forms,  consultas, relat&oacute;rios, gr&aacute;ficos, etc), service packs, tutoriais  diversos, etc. </p>   <p>- <a  href="http://www.correios.com.br/web_correio/html/servicos/cep/download.cfm">CEP  no Access - Correios</a> Nos Correios voc&ecirc; encontra todas as informa&ccedil;&otilde;es  e ferramentas necess&aacute;rias para implantar o CEP do seu estado ou de  todo o Brasil no seu sistema. </p>   <p>- <a href="http://www.sebrae.com.br/download/autodiagnostico/">SEBRAE</a>  - O SEBRAE desenvolveu um question&aacute;rio para ser aplicado &agrave; empresa para a qual vamos fazer um sistema. O objetivo &eacute; o de detectar se a empresa est&aacute; preparada para ser informatizada ou n&atilde;o. Quanto mais organizada for a empresa, mais apta para a informatiza&ccedil;&atilde;o.  Chama-se Auto Diagn&oacute;stico. </p>   <p>- <a href="http://www.rimrocksoftware.com/helpgen.html">Help Gen</a> Gerador  de Helps. </p>   <p>- <a href="http://members.tripod.com/Compudev/buttons.htm">Access Button  Collection</a> Uma enorme cole&ccedil;&atilde;o de bot&otilde;es de comando,  cada um com uma figura: setas, artes, livros, calculadores e muitas outras  categorias. &Eacute; oferecido um demo com algumas categorias. Vale a pena.  </p>   <p> </p>   <hr width="100%"> <br>  <b><font size="+1">Obs.:</font></b> Me ajuda a deixar esta se&ccedil;&atilde;o  cada vez mais rica: caso tenha algum link interessante de Access, mande para que eu compartilhe ou se notar que algum dos links aqui est&aacute; quebrado me d&ecirc; um toque.   <p>Ribamar FS <a href="mailto:ribafs@yahoo.com">ribafs@yahoo.com</a> <br>  24/12/1999 <br>  &nbsp; <!-- text below generated by server. PLEASE REMOVE --> </p> </body> 
<!-- Mirrored from www.psantos.org/ribafs/access/links.htm by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 30 Apr 2018 10:57:12 GMT -->
</html>