<!DOCTYPE html PUBLIC "-//w3c//dtd html 4.0 transitional//en">
<html>

<!-- Mirrored from www.psantos.org/ribafs/access/seguranca.htm by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 30 Apr 2018 10:56:10 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=UTF-8" /><!-- /Added by HTTrack -->
<head>

   
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

   
  <meta name="Generator" content="Microsoft Word 97">

   
  <meta name="GENERATOR" content="Mozilla/4.7 [en] (Win98; I) [Netscape]">

   
  <meta name="Author" content="Ribamar FS">

   
  <title>Cantinho dos Amantes do Access - Seguran&ccedil;a</title>
</head>


<body>


<table border="1" cols="8" width="100%">
  <tbody>
    <tr>

      <td>
      <center><font size="-1"><a href="introducao.html">Introdu&ccedil;&atilde;o</a></font></center>

      </td>


      <td>
      <center><font size="-1"><a href="tabelas.html">Tabelas</a></font></center>

      </td>


      <td>
      <center><font size="-1"><a href="relacionamentos.html">Relacionamentos</a></font></center>

      </td>


      <td>
      <center>&nbsp;<font size="-1"><a href="consultas.html">Consultas</a></font></center>

      </td>


      <td>
      <center><font size="-1"><a href="formularios.html">Formul&aacute;rios</a></font></center>

      </td>


      <td>
      <center>&nbsp;<font size="-1"><a href="relatorios.html">Relat&oacute;rios</a></font></center>

      </td>


      <td>
      <center>&nbsp;<font size="-1"><a href="macros.html">Macros</a></font></center>

      </td>


      <td>
      <center><font size="-1"><a href="modulos.html">M&oacute;dulos</a></font></center>

      </td>

    </tr>


    <tr>

      <td>
      <center><font size="-1"><a href="activex.html">ActiveX</a></font></center>

      </td>


      <td>
      <center>&nbsp;<font size="-1"><a href="automacao.html">Automa&ccedil;&atilde;oOLE</a></font></center>

      </td>


      <td>
      <center>&nbsp;<font size="-1"><a href="graficos.html">Gr&aacute;ficos</a></font></center>

      </td>


      <td>
      <center>&nbsp;<font size="-1"><a href="dao.html">DAO</a></font></center>

      </td>


      <td>
      <center>&nbsp;<font size="-1"><a href="sql.html">SQL</a></font></center>

      </td>


      <td>
      <center>&nbsp;<font size="-1"><a href="file:///E:/1Ribamar/1Sites/Access/seguranca.htm">Seguran&ccedil;a</a></font></center>

      </td>


      <td>
      <center><font size="-1"><a href="redes.html">Redes/ODBC</a></font></center>

      </td>


      <td>
      <center>&nbsp;<font size="-1"><a href="dicas.html">Dicas</a></font></center>

      </td>

    </tr>


    <tr>

      <td>
      <center>&nbsp;<font size="-1"><a href="cursoonline.html">Curso
Online</a></font></center>

      </td>


      <td>
      <center><font size="-1"><a href="wizards.html">Wizards</a></font></center>

      </td>


      <td>
      <center><font size="-1"><a href="ferramentas.html">Ferramentas</a></font></center>

      </td>


      <td>
      <center><font size="-1"><a href="help.html">Help</a></font></center>

      </td>


      <td>
      <center>&nbsp;<font size="-1"><a href="downloads.html">Downloads</a></font></center>

      </td>


      <td>
      <center>&nbsp;</center>
      </td>
    </tr>
  </tbody>
</table>
<center>
<p><b><font size="+2">SEGURAN&Ccedil;A</font></b></p>
</center>


<hr width="100%">
<b><a href="ControleDeSenhaGilson.zip">Senha atrav&eacute;s de InputBox
ou Caixa de Texto</a></b> - Mais uma colabora&ccedil;&atilde;o do Gilson
(<a href="mailto:gilson@oel.com.br">gilson@oel.com.br</a>): "consegui fazer
a senha aparecer com os aster&iacute;sticos e tamb&eacute;m limpar o campo
da senha quando do retorno de outro formul&aacute;rio para o formul&aacute;rio
da senha."
<p><b><a href="RecuperarBD.txt">Recupera&ccedil;&atilde;o de Banco de Dados
danificado</a></b> - Um verdadeiro manual para recupera&ccedil;&atilde;o
de bancos de dados danificados. Tradu&ccedil;&atilde;o livre de um dos
artigos Knowledge Base Access. Muito Bom.
</p>
<p><b><font size="+1"><a href="AssociarSistSeguroAutom.txt">Atalho para Sistema
seguro</a></font></b> - Esta foi uma dica enviada pelo Paulo (<a href="mailto:pbrazo@bol.com.br">pbrazo@bol.com.br</a>).
Quando temos algum sistema no qual implementamos a seguran&ccedil;a, este
sistema somente pode ser aberto quando nos associamos ao seu grupo de Trabalho.
Isto as vezes &eacute; meio inc&ocirc;modo, principalmente se precisamos
abrir v&aacute;rias vezes este sistema e voltamos para o grupo padr&atilde;o
do Access. A&iacute; entra a dica: crie um atalho que abre o sistema seguro
j&aacute; associado ao grupo.
</p>
<p><a href="RepBD2K.zip">Reparar Banco de Dados Access 2000</a> - Um utilit&aacute;rio
desenvolvido pelo Claudio Fartes <a href="mailto:%28ecsolutions@uol.com.br">(ecsolutions@uol.com.br</a>)
para reparar Bancos de Dados Access danificados.
</p>
<p><a href="RepairDB97.zip">Reparar Banco de Dados Access 97</a>.
</p>
<p>Mais um <a href="Senhabd.zip">programa para mostrar a senha de BD</a>.
Enviado pelo colega Sames Davis (samesdavis@mailbr.com.br).
</p>
<p><a href="SenhaRecuperar.zip">Como quebrar a senha de banco de dados
do Access?</a>
<br>
Veja este pequeno BD que mostra a senha de um Banco de Dados Access.
Detalhe &eacute; que esta rotina somente mostra a senha quando ela foi
colocada apenas no Banco de dados. Quando a seguran&ccedil;a foi implantada
a n&iacute;vel de usu&aacute;rio e de objeto este m&eacute;todo n&atilde;o
pode exibir a senha.
<br>
Este exemplo tamb&eacute;m vem com uma API (OpenFile).
</p>
<p><b><font size="-1">1) PASSO-A-PASSO PARA IMPLEMENTAR SEGURAN&Ccedil;A
NO ACCESS 97 <a href="#_Toc470779067">*</a></font></b>
</p>
<p><b><font size="-1">2) Expirar tempo de uso de Sistema <a href="#_Toc470779068">*</a></font></b>
</p>
<p><b><font size="-1">3) N&uacute;mero do winchester para Evitar Pirataria
de Sistema <a href="#_Toc470779069">*</a></font></b>
</p>
<p><b><font size="-1">4) Registro de Software <a href="#_Toc470779070">*</a></font></b>
<br>
&nbsp;
</p>
<p><a name="_Toc470779067"></a><b><font size="+1">1) PASSO-A-PASSO PARA IMPLEMENTAR
SEGURAN&Ccedil;A NO ACCESS 97</font></b>
</p>
<p>Ol&aacute; Ribamar!
</p>
<p>J&aacute; ouv&iacute; muita gente reclamando (ou zombando) da seguran&ccedil;a
do Access dizendo que naqueles tempos da vers&atilde;o 2 bastava copiar
um arquivo system.mda novo sobre o utilizado atualmente para p&ocirc;r
abaixo todas as nossas defesas.
</p>
<p>Na verdade, a falha est&aacute; na implementa&ccedil;&atilde;o da seguran&ccedil;a,
que exige a observa&ccedil;&atilde;o de uma s&eacute;rie de detalhes. Se
esquecermos de qualquer um, deixamos nosso trabalho vulner&aacute;vel.
</p>
<p>O Access por default d&aacute; direitos de administra&ccedil;&atilde;o
ao usu&aacute;rio. Isto ocorre sempre que a senha do usu&aacute;rio Administrador
estiver em branco. Esta &eacute; a principal falha de alguns bancos de
dados supostamente seguros: o usu&aacute;rio Administrador &eacute; o usu&aacute;rio
default do Access. Se substituirmos o arquivo MDA/MDW de sua aplica&ccedil;&atilde;o
pelo arquivo System.mda/mdw default, seremos automaticamente validados
como Administrador, e consequ&ecirc;ntemente poderemos acessar seu banco
de dados. A mesma regra vale para usu&aacute;rios e grupos de usu&aacute;rios.
</p>
<p>Resumindo, sugiro que voc&ecirc; siga rigorosamente os passos seguintes
para se
</p>
<p>obter uma boa seguran&ccedil;a inviol&aacute;vel de seu MDB:
</p>
<p><font color="#ff0000">Dica</font>: Caso deseje criar um menu para seu
sistema, deixe para criar depois de implantar a seguran&ccedil;a, sob pena
de perder seu trabalho. Isso levando em conta que est&aacute; criando com
um dos Wizards da Microsoft: Menu Builder ou Command Bar Wizard.
</p>
<p>1. Planeje cuidadosamente a seguran&ccedil;a de seu banco de dados (usu&aacute;rios,
permiss&otilde;es e senhas);
</p>
<p>2. Crie um Grupo de Trabalho seguro, executando o Administrador de Grupos
de Trabalho do Access: c:\windows\system\wrkgadm.exe.
<br>
Lembre-se de que o Access deve estar fechado.
</p>
<p>3. Usando o utilit&aacute;rio acima, associe-se a este grupo criado;
</p>
<p>4. Crie o usu&aacute;rio supervisor (Abra o Access - pode ser sem qualquer
BD aberto -, Ferramentas, Seguran&ccedil;a, Contas de usu&aacute;rio e
grupo... Usu&aacute;rio &ndash; Novo.
<br>
Digite um nome (Supervisor) e uma identifica&ccedil;&atilde;o para
ele (supervisor ou outra);
</p>
<p>5. Continuando v&aacute; em &ldquo;Alterar senha de logon&rdquo; e Estabele&ccedil;a
uma senha para o Administrador (Deixe a Senha atual em branco &ndash; caso ainda
n&atilde;o tenha uma e digite a Nova senha e confirme), para que na pr&oacute;xima
vez seja aberta a janela de logon do Access;
</p>
<p>6. Ainda na janela Contas de usu&aacute;rio e grupo, acrescente o usu&aacute;rio
supervisor ao grupo dos administradores (Com o usu&aacute;rio Supervisor
selecionado na caixa Nome, em Usu&aacute;rio, Administradores estando selecionado
em Grupos dispon&iacute;veis, clique em Adicionar);
</p>
<p>7. Crie os demais usu&aacute;rios e grupos (Usu&aacute;rio fa&ccedil;a
como fez para criar o Supervisor, Grupos, v&aacute; na aba Grupos, Novo
e d&ecirc; um Nome e uma Identifica&ccedil;&atilde;o para ele(s));
</p>
<p>8. Saia do Access e entre novamente, identificando-se como supervisor
(como voc&ecirc; ainda n&atilde;o deu uma senha ao Supervisor, basta digitar
o Nome e Enter ou Ok);
</p>
<p>9. Acesse Ferramentas &ndash; Seguran&ccedil;a &ndash; Contas de usu&aacute;rio
e grupo e retire do grupo administradores o usu&aacute;rio Administrador:
<br>
- Deixe Administrador selecionado na caixa Nome,
<br>
- Em Usu&aacute;rio e abaixo clique em Remover, para que Administradores
seja eliminado de Membro de:
<br>
- Lembrar que isso remove apenas o usu&aacute;rio Administrador do
grupo Administradores. D&ecirc; OK;
</p>
<p>10. Crie um novo banco de dados (onde o usu&aacute;rio supervisor ser&aacute;
o
<br>
propriet&aacute;rio). Aqui voc&ecirc; pode simplesmente fechar o Banco
de Dados atual sem fechar o Access e criar um novo, onde o Supervisor ser&aacute;
o propriet&aacute;rio;
</p>
<p>11. Retire os direitos de acesso dos grupos default (administradores
e usu&aacute;rios).
<br>
- V&aacute; em Ferramentas, Seguran&ccedil;a, Permiss&otilde;es para
usu&aacute;rio e grupo.
<br>
- Em Listar: clique no bot&atilde;o de op&ccedil;&atilde;o Grupos.&nbsp;
Selecione Administradores acima e em Tipo de objeto: selecione Banco de
Dados retire todas as permiss&otilde;es.
<br>
- Confirme e fa&ccedil;a o mesmo com o grupo Usu&aacute;rios;
</p>
<p>12. Importe os objetos de sua aplica&ccedil;&atilde;o para o novo arquivo
MDB
<br>
- Na Janela Banco de Dados, na aba Tabelas, clique com o bot&atilde;o
direito &ndash; Importar &ndash; Indique o BD.
<br>
- Assim fa&ccedil;a com os demais objetos (consultas, forms, etc)
</p>
<p>13. Defina permiss&otilde;es para os grupos
<br>
- Ferramentas &ndash; Seguran&ccedil;a - Permiss&otilde;es para usu&aacute;rio
e grupo
<br>
&ndash; Listar: Grupos e defina as permiss&otilde;es que deseja. Idem para
os usu&aacute;rios).
<br>
<font color="#ff0000">Dica</font>: Lembre que pode usar o recurso de
selecionar a primeira tabela, pressionar Shift e selecionar a &uacute;ltima
para selecionar todas.;
</p>
<p>14. Teste seu aplicativo, tentando abri-lo em outro computador, tentando
acessar &aacute;reas restritas com os diversos usu&aacute;rios do sistema.
</p>
<p>Depois de testado, fa&ccedil;a um beckup do novo arquivo system.mdw
e gere um MDE do seu sistema.
</p>
<p>Abra&ccedil;os,
</p>
<p>Vagner Izaias Ferreira
</p>
<p>Vagner'Soft Inform&aacute;tica Ltda.
<br>
&nbsp;
<br>
&nbsp;
</p>
<p><a name="_Toc470779068"></a><b><font size="+1">2) Expirar tempo de uso
de Sistema</font></b>
</p>
<p>Origem: Carlos Eduardo
</p>
<p>Testado na vers&atilde;o: 7.0
</p>
<p>Passos:
</p>
<p>1 - Crie uma tabela com os seguintes campos:
</p>
<p>Nome Tipo de Dados
</p>
<p>C&oacute;digo N&uacute;mero (Chave prim&aacute;ria)
</p>
<p>DataExp Data
</p>
<p>2 - Salve a tabela com o nome de DataExpirar;
</p>
<p>3 - No formul&aacute;rio que voc&ecirc; tem como o primeiro a ser aberto
junto com o banco de dados, no
</p>
<p>evento Ao Abrir do formul&aacute;rio, coloque a seguinte rotina:
</p>
<p>Dim db As DATABASE, t1 As Recordset
</p>
<p>Set db = CurrentDb
</p>
<p>Set t1 = db.OpenRecordset("DataExpirar", dbOpenDynaset)
</p>
<p>If t1.BOF = True Then
</p>
<p>t1.AddNew
</p>
<p>t1![C&oacute;digo] = 1
</p>
<p>t1![DataExp] = Date + 30 'Esta linha soma a data atual mais 30 dias
</p>
<p>t1.Update
</p>
<p>Else
</p>
<p>If t1![DataExp] &lt; Date Then
</p>
<p>Beep
</p>
<p>MsgBox "O prazo de utiliza&ccedil;&atilde;o deste aplicativo se esgotou!",
vbCritical
</p>
<p>Application.Quit acPrompt
</p>
<p>End If
</p>
<p>End If
</p>
<p>t1.Close
</p>
<p>4 - Est&aacute; pronto. Quando o formul&aacute;rio de abertura inicializar,
ir&aacute; verificar se h&aacute; alguma data
</p>
<p>cadastrada, caso isso j&aacute; tenha ocorrido, a rotina ir&aacute;
verificar se j&aacute; expirou a data.
</p>
<p>Para teste digite uma data com mais de 30 dias anterior a atual.
<br>
&nbsp;
<br>
&nbsp;
</p>
<p><a name="_Toc470779069"></a><b><font size="+1">3) N&uacute;mero do winchester
para Evitar Pirataria de Sistema</font></b>
</p>
<p>Enviado por: Carlos Eduardo
</p>
<p>Testado na vers&atilde;o: 7.0
</p>
<p>Passos:
</p>
<p>1 - Crie uma tabela com os seguintes campos:
</p>
<p>Nome Tipo de Dados
</p>
<p>C&oacute;digo N&uacute;mero (Chave prim&aacute;ria)
</p>
<p>NumSerial Texto
</p>
<p>2 - Salve a tabela com o nome de Serial;
</p>
<p>3 - Crie um novo m&oacute;dulo e coloque o seguinte texto (tudo numa
&uacute;nica linha):
</p>
<p>Declare Function GetVolumeInformation Lib "kernel32" Alias "GetVolumeInformationA"
(ByVal
</p>
<p>lpRootPathName As String, ByVal lpVolumeNameBuffer As String, ByVal
nVolumeNameSize As
</p>
<p>Long, lpVolumeSerialNumber As Long, lpMaximumComponentLength As Long,
</p>
<p>lpFileSystemFlags As Long, ByVal lpFileSystemNameBuffer As String, ByVal
</p>
<p>nFileSystemNameSize As Long) As Long
</p>
<p>4 - Salve o m&oacute;dulo com qualquer nome.
</p>
<p>5 - No formul&aacute;rio que voc&ecirc; tem como o primeiro a ser aberto
junto com o banco de dados, no
</p>
<p>evento Ao Abrir a seguinte fun&ccedil;&atilde;o:
</p>
<p>Dim lVSN As Long, n As Long, s1 As String, s2 As String
</p>
<p>Dim unidade, Serie As String
</p>
<p>Dim sTmp As String
</p>
<p>Dim db As DATABASE, t1 As Recordset
</p>
<p>On Local Error Resume Next
</p>
<p>'especifica-se o diretorio raiz
</p>
<p>unidade = "C:\"
</p>
<p>'Reservando espa&ccedil;o para os string que ser&atilde;o passados para
a API
</p>
<p>s1 = String$(255, Chr$(0))
</p>
<p>s2 = String$(255, Chr$(0))
</p>
<p>n = GetVolumeInformation(unidade, s1, Len(s1), lVSN, 0, 0, s2, Len(s2))
</p>
<p>'s1 ter&aacute; o label da unidade
</p>
<p>'lVSN ter&aacute; o serial number
</p>
<p>'s2 indica o tipo de grava&ccedil;&atilde;o de arquivo (se FAT, etc...)
</p>
<p>'Numero IVSN (serial number) &eacute; convertido para hexadecimal para
ser mostrado como no DIR
</p>
<p>sTmp = Hex$(lVSN)
</p>
<p>'Me.Text1 = s1
</p>
<p>Serie = Left$(sTmp, 4) &amp; "-" &amp; Right$(sTmp, 4)
</p>
<p>'Me.Text3 = s2
</p>
<p>Set db = CurrentDb
</p>
<p>Set t1 = db.OpenRecordset("Serial", dbOpenTable)
</p>
<p>'Valor1 = t1![NumSerial]
</p>
<p>If t1.BOF = True Then
</p>
<p>t1.AddNew
</p>
<p>t1![C&oacute;digo] = 1
</p>
<p>t1![NumSerial] = Serie
</p>
<p>t1.UPDATE
</p>
<p>'MsgBox t1![NumSerial]
</p>
<p>Else
</p>
<p>If t1![NumSerial] &lt;&gt; Serie Then
</p>
<p>MsgBox "Desculpe, mas este aplicativo n&atilde;o pode ser executado
neste computador e ser&aacute;
</p>
<p>fechado!", vbCritical
</p>
<p>Application.Quit acPrompt
</p>
<p>End If
</p>
<p>End If
</p>
<p>t1.Close
</p>
<p>6 - Est&aacute; pronto. Quando o formul&aacute;rio de abertura inicializar,
ir&aacute; recolher o n&uacute;mero de s&eacute;rie do
</p>
<p>winchester e caso n&atilde;o esteja armazenado na tabela ser&aacute;
gravado e se j&aacute; estiver, a fun&ccedil;&atilde;o ir&aacute;
</p>
<p>comparar para ver se o BD est&aacute; no mesmo computador.
</p>
<p>Observa&ccedil;&atilde;o: Se voc&ecirc; desejar mostrar os dados em
formul&aacute;rio, crie tr&ecirc;s caixas de textos
</p>
<p>com os respectivos nomes: Text1, Text2 e Text3. E retire o ' (ap&oacute;strofo)
nas linhas que
</p>
<p>comecem com 'Me.Tex.. .
<br>
&nbsp;
</p>
<p><a name="_Toc470779070"></a><b><font size="+1">4 Registro de Software</font></b>
</p>
<p>Voc&ecirc; n&atilde;o &eacute; obrigado a registrar seu software em
lugar nenhum. Apenas para resguardar suas marcas de pirataria, voce pode
registrar o nome do software (para isto voce tem que ter CGC) no INPI (www.inpi.gov.br),
e pode tambem registrar o software na SEI (Secretaria Especial de Informatica
- o pessoal do INPI te orienta neste sentido).
</p>
<p>As licencas de utilizacao de software sao como licencas de utilizacao
de propriedade intelectual. Voce paga apenas ISS (0,5 a 5% dependendo da
sua prefeitura), e ICMS sobre o valor dos disquetes/CDs de distribuicao
(n&atilde;o sobre o valor do software).
</p>
<p>Por exemplo, se voce vende um software em um CD, por R$ 99,00, voce
paga ISS
</p>
<p>sobre R$ 96,00 e ICMS sobre R$ 3,00 (valor do CD).
</p>
<p>Voce ainda tem a prerrogativa de vender o software como "servicos de
desenvolvimento de software", se o produto nao for de pratileira. Neste
caso, voce paga apenas ISS.
</p>
<p>Cordialmente,
</p>
<p>Sergio A. Albuquerque
</p>
<p>http://www.worknet.com.br
</p>
<p>OUTRO:
</p>
<p>Primeiramente, todos os softwares utilizados na confec&ccedil;&atilde;o
do seu sistema t&ecirc;m que ser oficiais e registrados junto aos respectivos
fabricantes, para que voc&ecirc; n&atilde;o seja acusado de pirataria.
</p>
<p>Para o desenvolvedor nada &eacute; necess&aacute;rio, uma vez que as
profiss&otilde;es relativas &agrave; Inform&aacute;tica n&atilde;o foram
regulamentadas. Juridicamente, "n&atilde;o existem" Analistas de Sistemas,
Programadores, etc...
</p>
<p>No final, depois de pronto, o seu sistema deve ser registrado junto
ao INPI (Instituto Nacional de Propriedade Industrial) para que voc&ecirc;
tenha direitos exclusivos sobre ele.
</p>
<p>Quando voc&ecirc; tiver clientes, fa&ccedil;a contratos de "Cess&atilde;o
de Direito de Uso", e n&atilde;o de venda de software. Ou seja, voc&ecirc;
permite que seus clientes utilizem seu software, mas eles n&atilde;o s&atilde;o
donos do seu sistema.
<br>

</p>
<hr width="100%">
</body>

<!-- Mirrored from www.psantos.org/ribafs/access/seguranca.htm by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 30 Apr 2018 10:56:19 GMT -->
</html>
